Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: the bus voltage (Vo) is an output voltage of the three-level boost converter; and
de_de: die Busspannung (Vo) eine Ausgangsspannung des dreistufigen Aufwärtswandlers ist; und

source: The control method according to claim 12, wherein the second driving signal has N pulses in a low-level time period of each period of the first driving signal, wherein frequencies corresponding to at least two pulses of the N pulses are different, wherein the first driving signal has a high voltage level and a low voltage level, and the low-level time period of each period of the first driving signal corresponds to a time period with the low voltage level of each period of the first driving signal.
de_de: Steuerungsverfahren nach Anspruch 12, wobei das zweite Treibersignal N Impulse in einer niedrigstufigen Zeitperiode jeder Periode des ersten Treibersignals aufweist, wobei Frequenzen, die den mindestens zwei Impulsen der N Impulse entsprechen, unterschiedlich sind, wobei das erste Treibersignal eine hohen Spannungsstufe und eine niedrigen Spannungsstufe aufweist und die niedrigstufige Zeitperiode jeder Periode des ersten Treibersignals einer Zeitperiode mit der niedrigen Spannungsstufe jeder Periode des ersten Treibersignals entspricht.

source: 1. A Bluetooth communication system, wherein the system comprises a first electronic device (12, 01) and a second electronic device (01, 02), wherein
de_de: 1. Bluetooth-Kommunikationssystem, wobei das System eine erste elektronische Vorrichtung (12, 01) und eine zweite elektronische Vorrichtung (01, 02) umfasst, wobei

source: the first electronic device (12, 01) is configured to send (S301) first version information to the second electronic device (01, 02), wherein the first version information is used for indicating a version of the first electronic device;
de_de: die erste elektronische Vorrichtung (12, 01) konfiguriert ist, um erste Versionsinformationen an die zweite elektronische Vorrichtung (01, 02) zu senden (S301), wobei die ersten Versionsinformationen zum Angeben einer Version der ersten elektronischen Vorrichtung verwendet werden;

source: the second electronic device (01, 02) is configured to: receive (S301) the first version information sent by the first electronic device (12, 01), and send (S303) confirmation information to the first electronic device based on the first version information, wherein the confirmation information is used for indicating that a version of the second electronic device is the same as the version of the first electronic device; and
de_de: die zweite elektronische Vorrichtung (01, 02) konfiguriert ist, um: die von der ersten elektronischen Vorrichtung (12, 01) gesendeten ersten Versionsinformationen zu empfangen (S301) und Bestätigungsinformationen an die erste elektronische Vorrichtung basierend auf den ersten Versionsinformationen zu senden (S303), wobei die Bestätigungsinformationen verwendet werden, um anzugeben, dass eine Version der zweiten elektronischen Vorrichtung mit der Version der ersten elektronischen Vorrichtung übereinstimmt; und

source: the first electronic device (12, 01) is further configured to: receive (S303) the confirmation information sent by the second electronic device (01, 02), and establish (S305) a Bluetooth connection to the second electronic device based on a first Bluetooth connection parameter, wherein
de_de: die erste elektronische Vorrichtung (12, 01) ferner konfiguriert ist, um: die von der zweiten elektronischen Vorrichtung (01, 02) gesendeten Bestätigungsinformationen zu empfangen (S303) und eine Bluetooth-Verbindung zu der zweiten elektronischen Vorrichtung basierend auf einem ersten Bluetooth-Verbindungsparameter herzustellen (S305), wobei

source: the first Bluetooth connection parameter is a Bluetooth connection parameter corresponding to the version of the first electronic device (12, 01);
de_de: der erste Bluetooth-Verbindungsparameter ein Bluetooth-Verbindungsparameter ist, der der Version der ersten elektronischen Vorrichtung (12, 01) entspricht;

source: wherein the second electronic device (01, 02) is further configured to send (S307) first parameter change indication information to the first electronic device (12, 01) if it is determined (S302), based on the version of the first electronic device that is indicated by the first version information, that the version of the first electronic device is different from the version of the second electronic device; and
de_de: wobei die zweite elektronische Vorrichtung (01, 02) ferner konfiguriert ist, um erste Parameteränderungsangabeinformationen an die erste elektronische Vorrichtung (12, 01) zu senden (S307), wenn basierend auf der Version der ersten elektronischen Vorrichtung, die durch die ersten Versionsinformationen angegeben ist, bestimmt wird (S302), dass die Version der ersten elektronischen Vorrichtung sich von der Version der zweiten elektronischen Vorrichtung unterscheidet; und

source: the first electronic device (12, 01) is further configured to:
de_de: die erste elektronische Vorrichtung (12, 01) ferner konfiguriert ist, um:

source: receive (S307) the first parameter change indication information sent by the second electronic device (01, 02), wherein the first parameter change indication information is used for indicating whether a stored Bluetooth connection parameter of the second electronic device is changed and indicating change content, wherein the stored Bluetooth connection parameter of the second electronic device is a Bluetooth connection parameter of a previous connection between the first and second electronic devices that is stored by the first electronic device;
de_de: von der zweiten elektronischen Vorrichtung (01, 02) gesendete erste Parameteränderungsangabeinformationen zu empfangen (S307), wobei die ersten Parameteränderungsangabeinformationen verwendet werden, um anzugeben, ob ein gespeicherter Bluetooth-Verbindungsparameter der zweiten elektronischen Vorrichtung geändert wurde, und um den Änderungsinhalts anzugeben, wobei der gespeicherte Bluetooth-Verbindungsparameter der zweiten elektronischen Vorrichtung ein Bluetooth-Verbindungsparameter einer vorherigen Verbindung zwischen der ersten und der zweiten elektronischen Vorrichtung ist, der von der ersten elektronischen Vorrichtung gespeichert wurde;

source: if the first parameter change indication information indicates that there is change content, determine (S308) a second Bluetooth connection parameter of the second electronic device (01, 02) based on the stored Bluetooth connection parameter of the second electronic device and the change content indicated by the first parameter change indication information; and
de_de: einen zweiten Bluetooth-Verbindungsparameters der zweiten elektronischen Vorrichtung (01, 02) basierend auf dem gespeicherten Bluetooth-Verbindungsparameter der zweiten elektronischen Vorrichtung und dem durch die ersten Parameteränderungsangabeinformationen angegebenen Änderungsinhalt zu bestimmen (S308), wenn die ersten Parameteränderungsangabeinformationen angeben, dass Änderungsinhalt vorliegt; und

source: establish (S309) the Bluetooth connection to the second electronic device (01, 02) based on the first Bluetooth connection parameter and the second Bluetooth connection parameter.
de_de: die Bluetooth-Verbindung mit der zweiten elektronischen Vorrichtung (01, 02) basierend auf dem ersten Bluetooth-Verbindungsparameter und dem zweiten Bluetooth-Verbindungsparameter herzustellen (S309).

source: 2. The system according to claim 1, wherein
de_de: 2. System nach Anspruch 1, wobei

source: the first electronic device (12, 01) is further configured to: if the first parameter change indication information indicates that there is no change content, establish (S310) the Bluetooth connection to the second electronic device (01, 02) based on the first Bluetooth connection parameter and the stored Bluetooth connection parameter of the second electronic device.
de_de: die erste elektronische Vorrichtung (12, 01) ferner konfiguriert ist, um: die Bluetooth-Verbindung mit der zweiten elektronischen Vorrichtung (01, 02) basierend auf dem ersten Bluetooth-Verbindungsparameter und dem gespeicherten Bluetooth-Verbindungsparameter der zweiten elektronischen Vorrichtung herzustellen (S310), wenn die ersten Parameteränderungsangabeinformationen angeben, dass kein geänderter Inhalt vorliegt.

source: 3. The system according to claim 1 or 2, wherein
de_de: 3. System nach Anspruch 1 oder 2, wobei

source: the second electronic device (01, 02) is further configured to flag the change content of the Bluetooth connection parameter of the second electronic device by flagging a mask, to obtain the first parameter change indication information.
de_de: die zweite elektronische Vorrichtung (01, 02) ferner konfiguriert ist, um den Änderungsinhalt des Bluetooth-Verbindungsparameters der zweiten elektronischen Vorrichtung durch Markieren einer Maske zu markieren, um die ersten Parameteränderungsangabeinformationen zu erlangen.

source: 4. The system according to any one of claims 1 to 2, wherein
de_de: 4. System nach einem der Ansprüche 1 bis 2, wobei

source: the first electronic device (12, 01) is further configured to: when the version of the second electronic device (01, 02) is different from the version of the first electronic device, send a second request message to the second electronic device, wherein the second request message comprises the first Bluetooth connection parameter of the first electronic device;
de_de: die erste elektronische Vorrichtung (12, 01) ferner konfiguriert ist, um: eine zweite Anforderungsnachricht an die zweite elektronische Vorrichtung zu senden, wenn die Version der zweiten elektronischen Vorrichtung (01, 02) sich von der Version der ersten elektronischen Vorrichtung unterscheidet, wobei die zweite Anforderungsnachricht den ersten Bluetooth-Verbindungsparameter der ersten elektronischen Vorrichtung umfasst;

source: the second electronic device (01, 02) is further configured to: receive the second request message sent by the first electronic device (12, 01), and send (S311) a second response message to the first electronic device based on the second request message, wherein the second response message comprises the second Bluetooth connection parameter of the second electronic device; and
de_de: die zweite elektronische Vorrichtung (01, 02) ferner konfiguriert ist, um: die von der ersten elektronischen Vorrichtung (12, 01) gesendete zweite Anforderungsnachricht zu empfangen und eine zweite Antwortnachricht an die erste elektronische Vorrichtung basierend auf der zweiten Anforderungsnachricht zu senden (S311), wobei die zweite Antwortnachricht den zweiten Bluetooth-Verbindungsparameter der zweiten elektronischen Vorrichtung umfasst; und

source: the first electronic device (12, 01) is further configured to: receive (S311) the second response message sent by the second electronic device (01, 02), and establish the Bluetooth connection to the second electronic device based on the first Bluetooth connection parameter and the second Bluetooth connection parameter.
de_de: die erste elektronische Vorrichtung (12, 01) ferner konfiguriert ist, um: die von der zweiten elektronischen Vorrichtung (01, 02) gesendeten zweite Antwortnachricht zu empfangen (S311) und die Bluetooth-Verbindung zu der zweiten elektronischen Vorrichtung basierend auf dem ersten Bluetooth-Verbindungsparameter und dem zweiten Bluetooth-Verbindungsparameter herzustellen.

source: 5. The system according to any one of claims 1 to 4, wherein
de_de: 5. System nach einem der Ansprüche 1 bis 4, wobei

source: the first electronic device (12, 01) is specifically configured to send (S301) a first request message to the second electronic device (01, 02), wherein the first request message comprises the first version information;
de_de: die erste elektronische Vorrichtung (12, 01) speziell konfiguriert ist, um eine erste Anforderungsnachricht an die zweite elektronische Vorrichtung (01, 02) zu senden (S301), wobei die erste Anforderungsnachricht die ersten Versionsinformationen umfasst;

source: the second electronic device (01, 02) is specifically configured to: receive (S307) the first request message sent by the first electronic device (12, 01), and send (S303) a first response message to the first electronic device based on the first request message, wherein the first response message comprises the confirmation information; and
de_de: die zweite elektronische Vorrichtung (01, 02) speziell konfiguriert ist, um: die von der ersten elektronischen Vorrichtung (12, 01) gesendete erste Anforderungsnachricht zu empfangen (S307) und eine erste Antwortnachricht an die erste elektronische Vorrichtung basierend auf der ersten Anforderungsnachricht zu senden (S303), wobei die erste Antwortnachricht die Bestätigungsinformationen umfasst; und

source: the first electronic device (12, 01) is further specifically configured to receive (S303) the first response message sent by the second electronic device (01, 02).
de_de: die erste elektronische Vorrichtung (12, 01) ferner speziell konfiguriert ist, um die von der zweiten elektronischen Vorrichtung (01, 02) gesendete erste Antwortnachricht zu empfangen (S303).

source: 6. A Bluetooth connection method, wherein the method comprises:
de_de: 6. Bluetooth-Kommunikationsverfahren, wobei das Verfahren Folgendes umfasst:

source: sending (S301), by a first electronic device (12, 01), first version information to a second electronic device (01, 02), wherein the first version information is used for indicating a version of the first electronic device;
de_de: Senden (S301) von ersten Versionsinformationen an eine zweite elektronische Vorrichtung (01, 02) durch eine erste elektronische Vorrichtung (12, 01), wobei die ersten Versionsinformationen zum Angeben einer Version der ersten elektronischen Vorrichtung verwendet werden;

source: receiving (S303), by the first electronic device (12, 01), confirmation information sent by the second electronic device (01, 02), wherein the confirmation information is used for indicating that a version of the second electronic device is the same as the version of the first electronic device; and
de_de: Empfangen (S303) von Bestätigungsinformationen, die von der zweiten elektronischen Vorrichtung (01, 02) gesendet wurden, durch die erste elektronische Vorrichtung (12, 01), wobei die Bestätigungsinformationen verwendet werden, um anzugeben, dass eine Version der zweiten elektronischen Vorrichtung mit der Version der ersten elektronischen Vorrichtung übereinstimmt; und

source: establishing (S305), by the first electronic device (12, 01), a Bluetooth connection to the second electronic device (01, 02) based on a first Bluetooth connection parameter, wherein
de_de: Herstellen (S305) einer Bluetooth-Verbindung mit der zweiten elektronischen Vorrichtung (01, 02) durch die erste elektronische Vorrichtung (12, 01) basierend auf einem ersten Bluetooth-Verbindungsparameter, wobei

source: the first Bluetooth connection parameter is a Bluetooth connection parameter corresponding to the version of the first electronic device;.
de_de: der erste Bluetooth-Verbindungsparameter ein Bluetooth-Verbindungsparameter ist, der der Version der ersten elektronischen Vorrichtung entspricht;.

source: wherein the method further comprises:
de_de: wobei das Verfahren ferner Folgendes umfasst:

source: when the version of the second electronic device (01, 02) is different from the version of the first electronic device (12, 01), receiving (S307) first parameter change indication information sent by the second electronic device, wherein the first parameter change indication information is used for indicating change content of a stored Bluetooth connection parameter of the second electronic device (01, 02), wherein the stored Bluetooth connection parameter of the second electronic device is a Bluetooth connection parameter of a previous connection between the first and second electronic devices that is stored by the first electronic device;
de_de: Empfangen (S307) von ersten Parameteränderungsangabeinformationen, die von der zweiten elektronischen Vorrichtung gesendet wurden, wenn die Version der zweiten elektronischen Vorrichtung (01, 02) sich von der Version der ersten elektronischen Vorrichtung (12, 01) unterscheidet, wobei die ersten Parameteränderungsangabeinformationen zum Angeben von Änderungsinhalt eines gespeicherten Bluetooth-Verbindungsparameters der zweiten elektronischen Vorrichtung (01, 02) verwendet werden, wobei der gespeicherte Bluetooth-Verbindungsparameter der zweiten elektronischen Vorrichtung ein Bluetooth-Verbindungsparameter einer vorherigen Verbindung zwischen der ersten und der zweiten elektronischen Vorrichtung ist, die von der ersten elektronischen Vorrichtung gespeichert wurde;

source: determining (S308) a second Bluetooth connection parameter of the second electronic device (01, 02) based on the stored Bluetooth connection parameter of the second electronic device and the change content indicated by the first parameter change indication information; and
de_de: Bestimmen (S308) eines zweiten Bluetooth-Verbindungsparameters der zweiten elektronischen Vorrichtung (01, 02) basierend auf dem gespeicherten Bluetooth-Verbindungsparameter der zweiten elektronischen Vorrichtung und dem durch die ersten Parameteränderungsangabeinformationen angegebenen Änderungsinhalt; und

source: establishing (S309) the Bluetooth connection to the second electronic device (01, 02) based on the first Bluetooth connection parameter and the second Bluetooth connection parameter.
de_de: Herstellen (S309) der Bluetooth-Verbindung mit der zweiten elektronischen Vorrichtung (01, 02) basierend auf dem ersten Bluetooth-Verbindungsparameter und dem zweiten Bluetooth-Verbindungsparameter.

source: 7. The method according to claim 6, wherein the method further comprises:
de_de: 7. Verfahren nach Anspruch 6, wobei das Verfahren ferner Folgendes umfasst:

source: if the first parameter change indication information indicates that the first Bluetooth connection parameter has no change content, establishing (S310) the Bluetooth connection to the second electronic device (01, 02) based on the first Bluetooth connection parameter and the stored Bluetooth connection parameter of the second electronic device.
de_de: Herstellen (S310) der Bluetooth-Verbindung mit der zweiten elektronischen Vorrichtung (01, 02) basierend auf dem ersten Bluetooth-Verbindungsparameter und dem gespeicherten Bluetooth-Verbindungsparameter der zweiten elektronischen Vorrichtung, wenn die ersten Parameteränderungsangabeinformationen angeben, dass kein geänderter Inhalt vorliegt.

source: 8. The method according to claim 6 or 7, wherein the first parameter change indication information is information obtained by flagging a mask.
de_de: 8. Verfahren nach Anspruch 6 oder 7, wobei die ersten Parameteränderungsangabeinformationen Information sind, die durch Markieren einer Maske erlangt werden.

source: 9. The method according to any one of claims 6 to 7, wherein the method further comprises:
de_de: 9. Verfahren nach einem der Ansprüche 6 bis 7, wobei das Verfahren ferner Folgendes umfasst:

source: when the version of the second electronic device (01, 02) is different from the version of the first electronic device (12, 01), sending, by the first electronic device, a second request message to the second electronic device, wherein the second request message comprises the first Bluetooth connection parameter of the first electronic device;
de_de: Senden einer zweiten Anforderungsnachricht an die zweite elektronische Vorrichtung durch die erste elektronische Vorrichtung, wenn die Version der zweiten elektronischen Vorrichtung (01, 02) sich von der Version der ersten elektronischen Vorrichtung (12, 01) unterscheidet, wobei die zweite Anforderungsnachricht den ersten Bluetooth-Verbindungsparameter der ersten elektronischen Vorrichtung umfasst;

source: receiving (S311), by the first electronic device (12, 01), a second response message sent by the second electronic device (01, 02), wherein the second response message comprises the second Bluetooth connection parameter of the second electronic device; and
de_de: Empfangen (S311) einer zweiten Antwortnachricht, die von der zweiten elektronischen Vorrichtung (01, 02) gesendet wurde, durch die erste elektronische Vorrichtung (12, 01), wobei die zweite Antwortnachricht den zweiten Bluetooth-Verbindungsparameter der zweiten elektronischen Vorrichtung umfasst; und

source: establishing, by the first electronic device (12, 01), the Bluetooth connection to the second electronic device (01, 02) based on the first Bluetooth connection parameter and the second Bluetooth connection parameter.
de_de: Herstellen der Bluetooth-Verbindung mit der zweiten elektronischen Vorrichtung (01, 02) durch die erste elektronische Vorrichtung (12, 01) basierend auf dem ersten Bluetooth-Verbindungsparameter und dem zweiten Bluetooth-Verbindungsparameter.

source: The method according to any one of claims 6 to 9, wherein the sending (S301), by a first electronic device (12, 01), first version information to a second electronic device (01, 02) comprises:
de_de: Verfahren nach einem der Ansprüche 6 bis 9, wobei das Senden (S301) von ersten Versionsinformationen durch eine erste elektronische Vorrichtung (12, 01) an eine zweite elektronische Vorrichtung (01, 02) umfasst:

source: sending, by the first electronic device (12, 01), a first request message to the second electronic device (01, 02), wherein the first request message comprises the first version information; and
de_de: Senden, durch die erste elektronische Vorrichtung (12, 01), einer ersten Anforderungsnachricht an die zweite elektronische Vorrichtung (01, 02), wobei die erste Anforderungsnachricht die ersten Versionsinformationen umfasst; und

source: the receiving (S303), by the first electronic device (12, 01), confirmation information sent by the second electronic device (01, 02) comprises:
de_de: Empfangen (S303) von Bestätigungsinformationen, die von der zweiten elektronischen Vorrichtung (01, 02) gesendet wurden, durch die erste elektronische Vorrichtung (12, 01), wobei das Empfangen umfasst:

source: receiving, by the first electronic device (12, 01), a first response message sent by the second electronic device (01, 02) for the first request message, wherein the first response message comprises the confirmation information.
de_de: Empfangen einer ersten Antwortnachricht, die von der zweiten elektronischen Vorrichtung (01, 02) auf die erste Anforderungsnachricht gesendet wurde, durch die erste elektronische Vorrichtung (12, 01), wobei die erste Antwortnachricht die Bestätigungsinformationen umfasst.

source: An electronic device (200), comprising a processor (201), wherein the processor is coupled to a memory (202), and the processor is configured to execute a computer program or instructions stored in the memory, so that the electronic device implements the method according to any one of claims 6 to 10.
de_de: Elektronische Vorrichtung (200), umfassend einen Prozessor (201), wobei der Prozessor mit einem Speicher (202) gekoppelt ist und der Prozessor konfiguriert ist, um ein Computerprogramm oder Anweisungen auszuführen, die in dem Speicher gespeichert sind, sodass die elektronische Vorrichtung das Verfahren nach einem der Ansprüche 6 bis 10 implementiert.
